Австралия/src/AccumulationRegisters/AccountsReceivable/AccountsReceivable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsReceivable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.FixedAssetSale</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/OperationTypesCashVoucher/OperationTypesCashVoucher.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesCashVoucher</name>
  <enumValues>
    <name>IssueLoanToCounterparty</name>
  </enumValues>
  <enumValues>
    <name>IssueLoanToEmployee</name>
  </enumValues>
  <enumValues>
    <name>LoanSettlements</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherSettlements</name>
  </enumValues>
  <enumValues>
    <name>Salary</name>
  </enumValues>
  <enumValues>
    <name>SalaryForEmployee</name>
  </enumValues>
  <enumValues>
    <name>Taxes</name>
  </enumValues>
  <enumValues>
    <name>ToAdvanceHolder</name>
  </enumValues>
  <enumValues>
    <name>ToCustomer</name>
  </enumValues>
  <enumValues>
    <name>TransferToCashCR</name>
  </enumValues>
  <enumValues>
    <name>Vendor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesPaymentExpense/OperationTypesPaymentExpense.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesPaymentExpense</name>
  <enumValues>
    <name>IssueLoanToCounterparty</name>
  </enumValues>
  <enumValues>
    <name>IssueLoanToEmployee</name>
  </enumValues>
  <enumValues>
    <name>LoanSettlements</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherSettlements</name>
  </enumValues>
  <enumValues>
    <name>Salary</name>
  </enumValues>
  <enumValues>
    <name>Taxes</name>
  </enumValues>
  <enumValues>
    <name>ToAdvanceHolder</name>
  </enumValues>
  <enumValues>
    <name>ToCustomer</name>
  </enumValues>
  <enumValues>
    <name>Vendor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesCashReceipt/OperationTypesCashReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesCashReceipt</name>
  <enumValues>
    <name>CurrencyPurchase</name>
  </enumValues>
  <enumValues>
    <name>FromAdvanceHolder</name>
  </enumValues>
  <enumValues>
    <name>FromCustomer</name>
  </enumValues>
  <enumValues>
    <name>FromVendor</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByCounterparty</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByEmployee</name>
  </enumValues>
  <enumValues>
    <name>LoanSettlements</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherSettlements</name>
  </enumValues>
  <enumValues>
    <name>RetailIncome</name>
  </enumValues>
  <enumValues>
    <name>RetailIncomeEarningAccounting</name>
  </enumValues>
  <enumValues>
    <name>PaymentFromThirdParties</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/OperationTypesPaymentReceipt/OperationTypesPaymentReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesPaymentReceipt</name>
  <enumValues>
    <name>CurrencyPurchase</name>
  </enumValues>
  <enumValues>
    <name>FromAdvanceHolder</name>
  </enumValues>
  <enumValues>
    <name>FromCustomer</name>
  </enumValues>
  <enumValues>
    <name>FromVendor</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByCounterparty</name>
  </enumValues>
  <enumValues>
    <name>LoanRepaymentByEmployee</name>
  </enumValues>
  <enumValues>
    <name>LoanSettlements</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherSettlements</name>
  </enumValues>
  <enumValues>
    <name>Taxes</name>
  </enumValues>
  <enumValues>
    <name>PaymentFromThirdParties</name>
  </enumValues>
  <enumValues>
    <name>PayoutFromPaymentProcessor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/SettlementsTypes/SettlementsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SettlementsTypes</name>
  <enumValues>
    <name>Debt</name>
  </enumValues>
  <enumValues>
    <name>Advance</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/FixedAssetSale/FixedAssetSale.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>FixedAssetSale</name>
  <registerRecords>InformationRegister.FixedAssetStatus</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesCashMethod</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.AccountsReceivable</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesRetained</registerRecords>
  <registerRecords>AccumulationRegister.FixedAssets</registerRecords>
  <registerRecords>AccumulationRegister.UnallocatedExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AmountIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeVATInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Multiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutomaticVATCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ForOpeningBalancesOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountsReceivableGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvancesReceivedGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FixedAssets</name>
    <attributes>
      <name>FixedAsset</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DepreciatedCost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Depreciation</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MonthlyDepreciation</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <comment>Amount</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <comment>Total</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
    <attributes>
      <name>IncomeItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Prepayment</name>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExchangeRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountDocCur</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/CommonForms/SelectDocumentOfSettlements/Module.bsl
#Region GeneralPurposeProceduresAndFunctions

// Gets query for customer settlement document selection for "Payment receipt" and "Cash receipt" documents.
// 
&AtServerNoContext
Function GetQueryTextAccountDocumentsOfAccountsReceivableReceipt(ShouldIncludeSalesInvicesOnly = False)
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments)
		And Not ShouldIncludeSalesInvicesOnly Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesFromConsignee)
		And Not ShouldIncludeSalesInvicesOnly Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AccountSalesFromConsignee AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.FixedAssetSale)
		And Not ShouldIncludeSalesInvicesOnly Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.FixedAssetSale AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DirectDebitMandate,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END AS Field2
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	// begin Drive.FullVersion
	
	If AccessRight("Read", Metadata.Documents.SubcontractorInvoiceIssued)
		And Not ShouldIncludeSalesInvicesOnly Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END AS Field2
		|FROM
		|	Document.SubcontractorInvoiceIssued AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	// end Drive.FullVersion
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

&AtServerNoContext
Function GetQueryTextAccountDocumentsOfThirdPartyPayment()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DirectDebitMandate,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets query for supplier settlement document selection for "Payment receipt" and "Cash Reciept" documents.
// 
&AtServerNoContext
Function GetQueryTextDocumentsOfAccountsPayableReceipt()
	
	QueryText =
	"SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.ExpenseReport) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	&CounterpartyByDefault,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ExpenseReport AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AdditionalExpenses) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AdditionalExpenses AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesToConsignor) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.AccountSalesToConsignor AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.CashVoucher) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashVoucher AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.DebitNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.DebitNote AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets a query for selecting accounts receivable documents for "Bank payment" and "Cash payment" documents.
// 
&AtServerNoContext
Function GetQueryTextAccountDocumentsOfAccountsReceivableWriteOff()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.OnlineReceipt)
		And GetFunctionalOption("UsePaymentProcessors") Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.OnlineReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesFromConsignee) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AccountSalesFromConsignee AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.FixedAssetSale) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.FixedAssetSale AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DirectDebitMandate,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.CreditNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CreditNote AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|	AND &SelectCreditNote";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets a query for selecting accounts payable documents for "Bank payment" and "Cash payment" documents.
// 
&AtServerNoContext
Function GetQueryTextDocumentsOfAccountsPayableWriteOff()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.AdditionalExpenses) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.AdditionalExpenses AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.CustomsDeclaration) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CustomsDeclaration AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	DocumentData.DirectDebitMandate,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.AccountSalesToConsignor) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE WHEN DocumentData.Posted THEN
		|		1
		|	WHEN DocumentData.DeletionMark THEN
		|		2
		|	ELSE
		|		0
		|	END
		|FROM
		|	Document.AccountSalesToConsignor AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ArApAdjustments) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.SettlementsAmount,
		|	VALUE(Catalog.Currencies.EmptyRef),
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ArApAdjustments AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorInvoiceReceived) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SubcontractorInvoiceReceived AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|";
		
	EndIf;
		
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

&AtServerNoContext
Function GetQueryTextDocumentForBankStatementProcessing()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets order from the settlement document header.
//
&AtServerNoContext
Function GetOrder(Document, ThisIsAccountsReceivable)
	
	If ThisIsAccountsReceivable Then
		
		If (TypeOf(Document) = Type("DocumentRef.ArApAdjustments")
			OR TypeOf(Document) = Type("DocumentRef.SupplierInvoice")
			OR TypeOf(Document) = Type("DocumentRef.SalesInvoice"))
			AND TypeOf(Document.Order) = Type("DocumentRef.SalesOrder") Then
			
			Order = Document.Order;
			
		Else
			
			Order = Documents.SalesOrder.EmptyRef();
			
		EndIf;
			
	Else
		
		If TypeOf(Document) = Type("DocumentRef.AdditionalExpenses") Then
			
			Order = Document.PurchaseOrder;
			
		ElsIf (TypeOf(Document) = Type("DocumentRef.ArApAdjustments")
			OR TypeOf(Document) = Type("DocumentRef.SupplierInvoice")
			OR TypeOf(Document) = Type("DocumentRef.SalesInvoice"))
			AND TypeOf(Document.Order) = Type("DocumentRef.PurchaseOrder") Then
			
			Order = Document.Order;
			
		ElsIf TypeOf(Document) = Type("DocumentRef.SubcontractorInvoiceReceived")
			AND TypeOf(Document.BasisDocument) = Type("DocumentRef.SubcontractorOrderIssued") Then
			
			Order = Document.BasisDocument;
			
		Else
			
			Order = Documents.PurchaseOrder.EmptyRef();
			
		EndIf;
		
	EndIf;
	
	Return Order;
	
EndFunction

// Gets advans payments to supplier.
//
&AtServerNoContext
Function GetQueryTextAdvancePaymentsReceived()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashVoucher) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashVoucher AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesCashVoucher.Vendor)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentExpense) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentExpense AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesPaymentExpense.Vendor)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets text for the Tax invoice received.
//
&AtServerNoContext
Function GetQueryTextTaxInvoiceReceived()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	VALUE(Catalog.Employees.EmptyRef) AS Employee,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.DebitNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	VALUE(Catalog.Employees.EmptyRef),
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.DebitNote AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON (DocumentData.Ref = BasisDocuments.BasisDocument
		|			AND BasisDocuments.Ref.Posted)
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SupplierInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	VALUE(Catalog.Employees.EmptyRef),
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SupplierInvoice AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON (DocumentData.Ref = BasisDocuments.BasisDocument
		|			AND BasisDocuments.Ref.Posted)
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SubcontractorInvoiceReceived) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	VALUE(Catalog.Employees.EmptyRef),
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SubcontractorInvoiceReceived AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON (DocumentData.Ref = BasisDocuments.BasisDocument
		|			AND BasisDocuments.Ref.Posted)
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.ExpenseReport) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	&CounterpartyByDefault,
		|	DocumentData.Employee,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.ExpenseReport AS DocumentData
		|		LEFT JOIN Document.ExpenseReport.Inventory AS ExpenseReportInventory
		|		ON DocumentData.Ref = ExpenseReportInventory.Ref
		|			AND (ExpenseReportInventory.Supplier = &CounterpartyByDefault)
		|			AND (ExpenseReportInventory.DeductibleTax)
		|		LEFT JOIN Document.ExpenseReport.Expenses AS ExpenseReportExpenses
		|		ON DocumentData.Ref = ExpenseReportExpenses.Ref
		|			AND (ExpenseReportExpenses.Supplier = &CounterpartyByDefault)
		|			AND (ExpenseReportExpenses.DeductibleTax)
		|WHERE
		|	DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|	AND (NOT ExpenseReportInventory.Ref IS NULL
		|			OR NOT ExpenseReportExpenses.Ref IS NULL)
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets advans payments from customer.
//
&AtServerNoContext
Function GetQueryTextAdvancePaymentsIssued()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CashReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CashReceipt AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceIssued.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesCashReceipt.FromCustomer)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.PaymentReceipt) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.PaymentReceipt AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceIssued.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.OperationKind = VALUE(Enum.OperationTypesPaymentReceipt.FromCustomer)
		|	AND DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.OnlineReceipt)
		And GetFunctionalOption("UsePaymentProcessors") Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.CashCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.OnlineReceipt AS DocumentData
		|WHERE
		|	DocumentData.Posted
		|	AND DocumentData.CashCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

// Gets text for the Tax invoice issued.
//
&AtServerNoContext
Function GetQueryTextTaxInvoiceIssued()
	
	QueryText =
	"SELECT ALLOWED
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|";
	
	If AccessRight("Read", Metadata.Documents.CreditNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CreditNote AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If AccessRight("Read", Metadata.Documents.SalesInvoice) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	&ContractByDefault,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.SalesInvoice AS DocumentData
		|		LEFT JOIN Document.TaxInvoiceReceived.BasisDocuments AS BasisDocuments
		|		ON DocumentData.Ref = BasisDocuments.BasisDocument
		|WHERE
		|	BasisDocuments.BasisDocument IS NULL
		|	AND DocumentData.Posted
		|	AND DocumentData.DocumentCurrency = &Currency
		|";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

&AtServerNoContext
Function GetQueryTextReturnAdvances(IsSupplierReturn)
	
	QueryText =
	"SELECT ALLOWED
	|	TableBalances.Company AS Company,
	|	TableBalances.Counterparty AS Counterparty,
	|	TableBalances.Contract AS Contract,
	|	TableBalances.Document AS Document,
	|	TableBalances.PresentationCurrency AS PresentationCurrency,
	|	TableBalances.AmountCurBalance AS AmountCur
	|INTO TT_Table
	|FROM
	|	AccumulationRegister.AccountsReceivable.Balance(
	|			,
	|			Company = &Company
	|				AND Counterparty = &CounterpartyByDefault
	|				AND CASE
	|					WHEN &ContractByDefault = VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|						THEN TRUE
	|					ELSE Contract = &ContractByDefault
	|				END
	|				AND SettlementsType = VALUE(Enum.SettlementsTypes.Advance)
	|				AND (&DocumentsType)) AS TableBalances
	|
	|UNION ALL
	|
	|SELECT
	|	Table.Company,
	|	Table.Counterparty,
	|	Table.Contract,
	|	Table.Document,
	|	Table.PresentationCurrency,
	|	CASE
	|		WHEN Table.RecordType = VALUE(AccumulationRecordType.Receipt)
	|			THEN -Table.AmountCur
	|		ELSE Table.AmountCur
	|	END
	|FROM
	|	AccumulationRegister.AccountsReceivable AS Table
	|WHERE
	|	Table.Recorder = &Ref
	|	AND Table.Company = &Company
	|	AND Table.Counterparty = &CounterpartyByDefault
	|	AND Table.SettlementsType = VALUE(Enum.SettlementsTypes.Advance)
	|	AND CASE
	|			WHEN &ContractByDefault = VALUE(Catalog.CounterpartyContracts.EmptyRef)
	|				THEN TRUE
	|			ELSE Table.Contract = &ContractByDefault
	|		END
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_Table.Company AS Company,
	|	TT_Table.Counterparty AS Counterparty,
	|	TT_Table.Contract AS Contract,
	|	TT_Table.Document AS Document,
	|	CounterpartyContracts.SettlementsCurrency AS SettlementsCurrency,
	|	-SUM(TT_Table.AmountCur) AS AmountCur
	|INTO TT_TableGrouped
	|FROM
	|	TT_Table AS TT_Table
	|		LEFT JOIN Catalog.CounterpartyContracts AS CounterpartyContracts
	|		ON TT_Table.Contract = CounterpartyContracts.Ref
	|WHERE
	|	TT_Table.AmountCur < 0
	|
	|GROUP BY
	|	TT_Table.Company,
	|	TT_Table.Counterparty,
	|	TT_Table.Contract,
	|	TT_Table.Document,
	|	CounterpartyContracts.SettlementsCurrency
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	UNDEFINED AS Ref,
	|	DATETIME(1, 1, 1) AS Date,
	|	CAST("""" AS STRING(20)) AS Number,
	|	VALUE(Catalog.Companies.EmptyRef) AS Company,
	|	&CounterpartyByDefault AS Counterparty,
	|	&ContractByDefault AS Contract,
	|	&DirectDebitMandateByDefault AS DirectDebitMandate,
	|	0 AS Amount,
	|	&Currency AS Currency,
	|	UNDEFINED AS Type,
	|	0 AS DocumentStatus
	|WHERE
	|	FALSE
	|
	|UNION ALL
	|
	|SELECT
	|	TT_TableGrouped.Document,
	|	TT_TableGrouped.Document.Date,
	|	TT_TableGrouped.Document.Number,
	|	TT_TableGrouped.Company,
	|	TT_TableGrouped.Counterparty,
	|	TT_TableGrouped.Contract,
	|	VALUE(Catalog.DirectDebitMandates.EmptyRef),
	|	TT_TableGrouped.AmountCur,
	|	TT_TableGrouped.SettlementsCurrency,
	|	VALUETYPE(TT_TableGrouped.Document),
	|	1
	|FROM
	|	TT_TableGrouped AS TT_TableGrouped";
	
	If IsSupplierReturn Then
		QueryText = StrReplace(QueryText, "AccountsReceivable", "AccountsPayable");
		QueryText = StrReplace(QueryText, "&DocumentsType", "
		|					Document REFS Document.CashVoucher
		|					OR Document REFS Document.DebitNote
		|					OR Document REFS Document.PaymentExpense");
	Else
		QueryText = StrReplace(QueryText, "&DocumentsType", "
		|					Document REFS Document.CashReceipt
		|					OR Document REFS Document.PaymentReceipt
		|					OR Document REFS Document.CreditNote
		|					OR Document REFS Document.OnlineReceipt");
	EndIf;

	Return QueryText;
	
EndFunction

// Gets text for the credit note document.
//
&AtServerNoContext
Function GetQueryTextCreditNote(QueryText)
	
	If AccessRight("Read", Metadata.Documents.CreditNote) Then
		
		QueryText = QueryText + "UNION ALL";
		
		QueryText = QueryText +
		"
		|SELECT
		|	DocumentData.Ref,
		|	DocumentData.Date,
		|	DocumentData.Number,
		|	DocumentData.Company,
		|	DocumentData.Counterparty,
		|	DocumentData.Contract,
		|	&DirectDebitMandateByDefault,
		|	DocumentData.DocumentAmount,
		|	DocumentData.DocumentCurrency,
		|	VALUETYPE(DocumentData.Ref),
		|	CASE
		|		WHEN DocumentData.Posted
		|			THEN 1
		|		WHEN DocumentData.DeletionMark
		|			THEN 2
		|		ELSE 0
		|	END
		|FROM
		|	Document.CreditNote AS DocumentData
		|WHERE
		|	DocumentData.Posted";
		
	EndIf;
	
	If Left(QueryText, 10) = "UNION" Then
		QueryText = Mid(QueryText, 14);
	EndIf;
	
	Return QueryText;
	
EndFunction

#EndRegion

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisIsAccountsReceivable = Parameters.ThisIsAccountsReceivable;
	
	ThisIsBankStatementProcessing = Parameters.Property("ThisIsBankStatementProcessing");
	ThisIsAdvancePaymentsReceived = Parameters.Property("ThisIsAdvancePaymentsReceived");
	ThisIsAdvancePaymentsIssued = Parameters.Property("ThisIsAdvancePaymentsIssued");
	ThisIsTaxInvoiceReceived = Parameters.Property("ThisIsTaxInvoiceReceived");
	ThisIsTaxInvoiceIssued = Parameters.Property("ThisIsTaxInvoiceIssued");
	ThisIsThirdPartyPayment = Parameters.Property("ThisIsThirdPartyPayment");
	
	IsCustomerReturn = False;
	If Parameters.Property("IsCustomerReturn") Then
		IsCustomerReturn = Parameters.IsCustomerReturn;
	EndIf;	
	IsSupplierReturn = False;
	If Parameters.Property("IsSupplierReturn") Then
		IsSupplierReturn = Parameters.IsSupplierReturn;
	EndIf;	
	
	DocumentType = Parameters.DocumentType;
	
	If IsCustomerReturn Or IsSupplierReturn Then
		
		List.QueryText = GetQueryTextReturnAdvances(IsSupplierReturn);
		
	ElsIf DocumentType = Type("DocumentRef.PaymentReceipt")
		OR DocumentType = Type("DocumentRef.CashReceipt") 
		OR DocumentType = Type("DocumentRef.DebitNote")
		OR DocumentType = Type("DocumentRef.DirectDebit") Then
		
		If ThisIsAccountsReceivable Then
			List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableReceipt();
		ElsIf ThisIsThirdPartyPayment Then
			List.QueryText = GetQueryTextAccountDocumentsOfThirdPartyPayment();
		Else
			List.QueryText = GetQueryTextDocumentsOfAccountsPayableReceipt();
		EndIf;
		
	ElsIf DocumentType = Type("DocumentRef.OnlineReceipt") Then
		
		List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableReceipt(True);
		
	ElsIf DocumentType = Type("DocumentRef.OnlinePayment") Then
		
		If Parameters.Filter.AdvanceFlag Then
			List.QueryText = GetQueryTextAdvancePaymentsIssued();
		Else
			List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableReceipt(True);
		EndIf;
		
		List.QueryText = GetQueryTextCreditNote(List.QueryText);
	Else
		
		If ThisIsAccountsReceivable Then
			List.QueryText = GetQueryTextAccountDocumentsOfAccountsReceivableWriteOff();
			List.Parameters.SetParameterValue("SelectCreditNote", DocumentType <> Type("DocumentRef.CreditNote"));
		ElsIf ThisIsBankStatementProcessing Then
			List.QueryText = GetQueryTextDocumentForBankStatementProcessing();
		ElsIf ThisIsAdvancePaymentsReceived Then
			List.QueryText = GetQueryTextAdvancePaymentsReceived();
		ElsIf ThisIsAdvancePaymentsIssued Then
			List.QueryText = GetQueryTextAdvancePaymentsIssued();
		ElsIf ThisIsTaxInvoiceReceived Then
			List.QueryText = GetQueryTextTaxInvoiceReceived();
		ElsIf ThisIsTaxInvoiceIssued Then
			List.QueryText = GetQueryTextTaxInvoiceIssued();
		Else
			List.QueryText = GetQueryTextDocumentsOfAccountsPayableWriteOff();
		EndIf;
		
	EndIf;
	
	Items.Company.Visible = Not Parameters.Filter.Property("Company");
	Items.Employee.Visible = ThisIsTaxInvoiceReceived;
	
	If Parameters.Filter.Property("Counterparty") Then
		Items.Counterparty.Visible = True;
		List.Parameters.SetParameterValue("CounterpartyByDefault", Parameters.Filter.Counterparty);
	Else
		Items.Counterparty.Visible = False;
		List.Parameters.SetParameterValue("CounterpartyByDefault", Catalogs.Counterparties.EmptyRef());
	EndIf;
	
	If Parameters.Filter.Property("Contract") Then
		List.Parameters.SetParameterValue("ContractByDefault", Parameters.Filter.Contract);
	Else
		List.Parameters.SetParameterValue("ContractByDefault", Catalogs.CounterpartyContracts.EmptyRef());
	EndIf;
	
	If Parameters.Filter.Property("DirectDebitMandate") Then
		List.Parameters.SetParameterValue("DirectDebitMandateByDefault", Parameters.Filter.DirectDebitMandate);
	Else
		List.Parameters.SetParameterValue("DirectDebitMandateByDefault", Catalogs.DirectDebitMandates.EmptyRef());
	EndIf; 
	
	If Parameters.Filter.Property("Currency") Then
		List.Parameters.SetParameterValue("Currency", Parameters.Filter.Currency);
	ElsIf Parameters.Filter.Property("DocumentCurrency") Then
		List.Parameters.SetParameterValue("Currency", Parameters.Filter.DocumentCurrency);
	Else
		List.Parameters.SetParameterValue("Currency", Catalogs.Currencies.EmptyRef());
	EndIf;
	
	If IsCustomerReturn Or IsSupplierReturn  Then
		If Parameters.Property("Document") Then
			List.Parameters.SetParameterValue("Ref", Parameters.Document);
		EndIf;
		
		If Parameters.Filter.Property("Company") Then
			List.Parameters.SetParameterValue("Company", Parameters.Filter.Company);
		EndIf;
	EndIf;
	
	//Conditional appearance
	SetConditionalAppearance();
	
EndProcedure

#EndRegion

#Region ActionsOfTheFormCommandPanels

// The procedure is called when clicking button "Select".
//
&AtClient
Procedure ChooseDocument(Command)
	
	CurrentData = Items.List.CurrentData;
	If CurrentData <> Undefined Then
		
		DocumentData = New Structure;
		DocumentData.Insert("Document", CurrentData.Ref);
		DocumentData.Insert("Contract", CurrentData.Contract);
		
		Order = GetOrder(CurrentData.Ref, ThisIsAccountsReceivable);
		DocumentData.Insert("Order", Order);
		
		NotifyChoice(DocumentData);
	Else
		Close();
	EndIf;
	
EndProcedure

// The procedure is called when clicking button "Open document".
//
&AtClient
Procedure OpenDocument(Command)
	
	TableRow = Items.List.CurrentData;
	If TableRow <> Undefined Then
		ShowValue(Undefined,TableRow.Ref);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormFieldEventHandlers

&AtClient
Procedure ListSelection(Item, SelectedRow, Field, StandardProcessing)
	
	CurrentData = Items.List.CurrentData;
	
	DocumentData = New Structure;
	DocumentData.Insert("Document", CurrentData.Ref);
	DocumentData.Insert("Contract", CurrentData.Contract);
	
	Order = GetOrder(CurrentData.Ref, ThisIsAccountsReceivable);
	DocumentData.Insert("Order", Order);
	
	NotifyChoice(DocumentData);
	
EndProcedure

#EndRegion

#Region Private

// Procedure set conditional appearance
//
&AtServer
Procedure SetConditionalAppearance()
	
	//List
	ItemAppearance = ConditionalAppearance.Items.Add();
	
	DataFilterItem					= ItemAppearance.Filter.Items.Add((Type("DataCompositionFilterItem")));
	DataFilterItem.LeftValue		= New DataCompositionField("List.DocumentStatus");
	DataFilterItem.ComparisonType	= DataCompositionComparisonType.NotEqual;
	DataFilterItem.RightValue		= 0;
	DataFilterItem.Use				= True;
	
	ColorBlack = StyleColors.BusinessCalendarDayKindWorkdayColor;
	ItemAppearance.Appearance.SetParameterValue("TextColor", ColorBlack);
	
	FieldAppearance = ItemAppearance.Fields.Items.Add();
	FieldAppearance.Field = New DataCompositionField("List");
	FieldAppearance.Use = True;
	
EndProcedure

#EndRegion
